import { _decorator, Component, EventTouch, instantiate, Node, Prefab, resources } from 'cc';
import { DataManager } from '../Framework/Managers/DataManager';
import { SelectGamePanelButtom } from './SelectGamePanelButtom';
import { PanelBase } from '../Framework/UI/PanelBase';
const { ccclass, property } = _decorator;

@ccclass('SelectGamePanel')
export class SelectGamePanel extends PanelBase {
    @property(Node)
    public Content: Node = null;

    public static SeletGameData: { type: string, Data: string[] }[] = [
        {
            type: '最新关卡',


            Data: [
                "糖葫芦吃播", "山海经制作", "炒酸奶", "山海经图鉴", "山海经怪谈", "千万别眨眼", "山海经试卷", "猛鬼飞机山海经", "山海经躲猫猫", "山海经找卧底", "山海经救援", "逃离秦始皇1", "逃离秦始皇2", "逃离秦始皇3", "小棍棍过河", "山海经女巫的毒药", "山海经洞洞乐", "菠萝猩猩拼图", "清理牙齿", "山海经安静书1", "山海经安静书2",
                "山海经安静书3", "清理耳朵", "找出男厕所", "咖啡穿搭", "奶油手机", "便当收纳", "女巫毒药猫咪版", "大展鸿图", "三角洲开箱", "山海经打电话",
                "卡布奇诺带娃", "山海经拼图1", "山海经拼图2", "山海经拼图3", "山海经拼图4", "女巫的毒药", "山海经修复", "合成挑战之山海经", "AI山海经", "AI山海经贴纸", "合成山海经",
                "山海经化妆", "层层山海经", "帮卡布奇诺穿搭", "喊妈妈起床", "山海经公园", "清洗山海经", "木棍人快逃", "山海经养宝宝", "山海经暂停挑战", "山海经上厕所", "山海经打电话",
                "刮鳞大师1", "刮鳞大师2", "刮鳞大师3", "刮鳞大师4", "刮鳞大师5", "刮鳞大师6", "刮鳞大师7", "刮鳞大师8", "刮鳞大师9", "刮鳞大师10", "刮鳞大师11", "刮鳞大师12",
                "山海经大冒险", "组合山海经", "山海经之猜猜我是谁", "山海经音乐盒", "帮女生上楼", "帮女生下楼",
                "躲猫猫1", "躲猫猫2", "躲猫猫3", "躲猫猫4", "躲猫猫5", "躲猫猫6", "躲猫猫7", "躲猫猫8", "躲猫猫9", "躲猫猫10", "躲猫猫11", "躲猫猫12", "躲猫猫13",
                "鬼附身", "帮助哪吒和敖丙入睡", "龙王美甲", "藕粉捏人", "天庭安检", "收拾房间", "拯救敖丙", "闺蜜结婚",
                "李代桃僵", "太乙抓哪吒", "帮助龙宫一家减肥", "豹子精修炼", "收纳整理1", "密室逃脱2", "哪吒安静书4", "切物品3", "哪吒连连字3",
                "哪吒拼图", "节奏盒子哪吒版", "香蕉猴找不同1", "香蕉猴找不同2", "香蕉猴找不同3", "批改阿强作业2", "哪吒假粉丝", "手机充电", "密室逃脱3", "哪吒连连字6", "贴纸化妆",
                "哪吒安静书6", "切物品1", "童话镇文字连梗", "同色消除打螺丝2", "哪吒连连字9", "找出假哪吒", "收纳整理2", "哪吒拆盲盒",
                "批改阿珍作业2", "哪吒安静书2", "切物品4", "哪吒连连字5", "节奏盒子连线3", "企鹅碰一碰2",
                "哪吒安静书5", "批改阿强作业", "哪吒连连字7", "密室逃脱", "切物品2", "哪吒安静书1", "哪吒连连字4", "批改阿珍作业", "哪吒安静书3",
                "同色消除打螺丝1", "哪吒连连字8", "节奏盒子连线2", "批改数学作业", "一笔画3", "哪吒连连字10", "节奏盒子连线1",
                "同色消除打螺丝3", "批改数学测验", "哪吒连连字2", "揽佬语音盒", "太乙抓哪吒3", "太乙抓哪吒2", "企鹅碰一碰1",
                "成语填空2", "成语填空1", "一笔画1", "口算pk", "拯救小鱼", "企鹅碰一碰3", "寻猫启示", "外卖单", "借条",
                "卖楼日记", "咕卡达人", "找出缺少的数字", "听泉战歌", "老鼠怕猫", "一笔画4", "鸡鸭收纳师", "乐意效劳",
                "我有一个帽衫", "谢帝我要diss你", "臣妾要告发熹贵妃", "歌词连梗520am", "魔镜魔镜", "批改阿邦作业", "批改小明作业",
                "文字连梗", "我是奶龙文字连梗", "睡蕉小猴文字连梗", "一笔画2", "苹果香文字连梗", "卡皮巴拉连梗", "搞点动静狗连梗",
                "大菠萝连梗", "毒液连梗", "哪吒歌词连梗", "哄敖闰兄妹入睡", "帮哪吒逃离", "滑动消除方块", "阳光彩虹小白马",
                "他们朝我扔泥巴", "猜猜我是谁"]
        },
        {
            type: 'AI山海经',
            Data: ["山海经制作", "山海经图鉴", "千万别眨眼", "山海经试卷", "山海经躲猫猫", "小棍棍过河", "山海经洞洞乐", "山海经盲盒", "山海经安静书1", "山海经安静书2", "山海经安静书3", "咖啡穿搭", "山海经化妆", "层层山海经", "山海经公园", "清洗山海经", "木棍人快逃", "山海经养宝宝", "山海经暂停挑战", "山海经上厕所", "舞女带娃", "山海经打电话", "山海经选性别", "山海经拼图1", "山海经拼图2", "山海经拼图3", "山海经拼图4",
                "山海经变身", "山海经修复", "合成挑战之山海经", "山海经大冒险",
                "AI山海经", "AI山海经贴纸", "合成山海经", "组合山海经", "山海经之猜猜我是谁", "山海经音乐盒"]
        },
        {
            type: '逃出生天',
            Data: ["躲猫猫1", "躲猫猫2", "躲猫猫3", "躲猫猫4", "躲猫猫5", "躲猫猫6", "躲猫猫7", "躲猫猫8", "躲猫猫9",
                "躲猫猫10", "躲猫猫11", "躲猫猫12", "躲猫猫13", "密室逃脱", "密室逃脱2", "密室逃脱3"]
        },
        {
            type: '万物切割',
            Data: ["百切tungtung", "百切黄金鲨鱼", "百切融合怪",
                "刮鳞大师1", "刮鳞大师2", "刮鳞大师3", "刮鳞大师4", "刮鳞大师5", "刮鳞大师6", "刮鳞大师7", "刮鳞大师8", "刮鳞大师9", "刮鳞大师10", "刮鳞大师11", "刮鳞大师12",
                "切物品1", "切物品2", "切物品3", "切物品4"]
        },
        {
            type: '脑洞找茬',
            Data: ["帮女生下楼", "帮女生上楼", "哄敖闰兄妹入睡", "拯救敖丙", "闺蜜结婚", "豹子精修炼", "帮助哪吒和敖丙入睡", "藕粉捏人", "龙王美甲", "天庭安检", "收拾房间", "李代桃僵", "帮助龙宫一家减肥", "哪吒假粉丝", "找出假哪吒", "手机充电", "大香蕉1",
                "大香蕉2", "大香蕉3", "拯救小鱼", "帮哪吒逃离", "鬼附身"]
        },
        {
            type: '玩梗连词',

            Data: ["大展鸿图", "他们朝我扔泥巴", "阳光彩虹小白马", "童话镇文字连梗", "节奏盒子哪吒版", "节奏盒子连线1",
                "节奏盒子连线2", "节奏盒子连线3", "哪吒连连字2", "哪吒连连字3", "哪吒连连字4", "哪吒连连字5", "哪吒连连字6", "哪吒连连字7",
                "哪吒连连字8", "哪吒连连字9", "哪吒连连字10", "听泉战歌",
                "老鼠怕猫", "鸡鸭收纳师", "乐意效劳", "我有一个帽衫", "谢帝我要diss你", "臣妾要告发熹贵妃",
                "歌词连梗520am", "文字连梗", "我是奶龙文字连梗", "睡蕉小猴文字连梗", "苹果香文字连梗", "卡皮巴拉连梗",
                "搞点动静狗连梗", "大菠萝连梗", "毒液连梗", "哪吒歌词连梗"
            ]
        },
        {
            type: '趣味文字',
            Data: ["外卖单", "借条", "卖楼日记", "寻猫启示", "批改阿强作业2", "批改阿珍作业2", "批改阿强作业", "批改阿珍作业", "批改数学作业", "批改数学测验", "成语填空2", "成语填空1", "口算PK",
                "找出缺少的数字", "批改阿邦作业", "批改小明作业"
            ]
        },
    ]
    Show(...args: any[]): void {
        super.Show(this.node);

    }
    start() {
        resources.load("Prefabs/UI/SelectGamePanelButtom", Prefab, (err, pre) => {
            if (err) {
                console.log("没有找到选关界面按钮预制体！");
                return;
            }
            for (let index = 0; index < SelectGamePanel.SeletGameData.length; index++) {
                let nd = instantiate(pre);
                nd.setParent(this.Content);
                let data = DataManager.GetDataByNames(SelectGamePanel.SeletGameData[index].Data);
                nd.getComponent(SelectGamePanelButtom).GameData = data;
                nd.getComponent(SelectGamePanelButtom).Init(SelectGamePanel.SeletGameData[index].type);
            }
        })


    }



}


