
export class BZJXL_GameData {
    static StartStr: string[] = [
        "申公豹，你是我们豹子精的唯一希望，希望你能够成功成仙",
        "爹，我一定不会让你失望"
    ];
    static GameStrs: string[][] = [
        ["孩子要吃健康的奶粉", "大鱼大肉吃多了，人戾气就重了"],
        ["练武得从小抓起", "孩子初期还是多以快乐成长为主"],
        ["从小我就得开始卷高考", "孩子初期得多启蒙他的思想"],
        ["起步比别人落后，后面当然不能落后", "多玩这个脑子灵光"],
        ["师兄人还是非常好的", "这人有点毛病"],
        ["成功主要还是靠自身努力", "拜神能干嘛，整天整这些有的没的"],
        ["拜在无良仙翁门下", "拜在元始天尊门下"]
    ]
    static EndStr = "勇于反抗强权，就是我仙道";
    static WinStr = "管你乱七八糟的，老子不服就干";
    static FailStr: string[] = [
        "太乙啊，剩下一个公务员的位置就给你吧",
        "人心中的成见就是一座大山，我还是失败了"
    ];
}


